#ამოცანა 1
a = eval(input("შეიტანეთ პირველი რიცხვი:"))
b = eval(input("შეიტენეთ მეორე რიცხვი:"))

print("ჯამი არის", a+b)
print("სხვაობა არის", a-b)
print("ნამრავლი არის", a*b)
print("განაყოფი არის", a/b)
print("მთელი განაყოფი არის", a//b)
print(f"ნაშთი {a} გაყოფილი {b}:", a%b)
print(f"ნაშთი {b} გაყოფილი {a}:", b%a)
print("ახარისხებული:", a**b)

#ამოცანა 2
d1 = eval(input("პირველი დიაგონალის სიგრძე:"))
d2 = eval(input("მეორე დიაგონალის სიგრძე:"))
print("რომბის ფართობი:", (d1 * d2)/2)


#ამოცანა 3
m = eval(input("შეიყვანეთ რიცხვი:"))

print(f"{m} მეტრი არის {m/10} დიამეტრი")
print(f"{m} მეტრი არის {m/100} სანტიმეტრი")
print(f"{m} მეტრი არის {m/10002} მილიმეტრი")

#ამოცანა 4
h = eval(input("შეიყვანეთ სამკუთხის სიმაღლე:"))
b = eval(input("შეიყვანეთ სამკუთხის ფუძე:"))

print("სამკუთხედის ფართობია", h*b/2)

#ამოცანა 5
a =input("შეიყვანეთ ორნიშნა რიცხვი:")
b =input("შეიყვანეთ ორნიშნა რიცხვი:")

#პირობიდან როგორც მივხვდი მხოლოდ ორნიშნა რიცხვებზე უნდა დაწეროს ჯამი, შესაბამისად მაგიტომ ვწერ if ის წინადადებას.
if len(a) == 2 and len(b)==2:
    print("რიცხვთა ჯამია:",eval(a)+eval(b))
else:
    print("ერთ-ერთი რიცხვი არ არის ორნიშნა.")
$#
