"""
ამოცანა 1:
 დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.
"""
n = int(input("ჩაწერეთ რიცხვი: "))
sum = 0
#ეს ფორ ციკლი გვაძლევს ჯამს n-1-ის ჩათვლით თუ გვაინტერესებს n-ის ჩათვლით, მაშინ n+1 უნდა ჩავწეროთ range-ში
for num in range(n):
  sum += num

print(f"0-დან {n}-მდე ყველა რიცხვების ჯამია რიცხვი {sum}") 

"""
ამოცანა 2: 
 დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს 
 რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1
"""

n = int(input("ჩაწერეთ რიცხვი: "))

while True:
    if n<1:
        break
    print(n, end = ' ')
    n-=1

"""
ამოცანა 3:
 დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. 
 როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.
"""

import random

a = random.randint(1,100)
print("თქვენ უნდა გამოიცნოთ ჩაფიქრებული რიცხვი!")
b = int(input("ჩაწერეთ რიცხვი: "))
while True:
    if a == b:
        print("სწორად გამოიცანით, გილოცავთ!")
        break
    elif a>b:
        b = int(input("ჩაფიქრებული რიცხვი მეტია თქვენს მიერ გამოცნობილ რიცხვიზე, ცადეთ ხელთავიდან:"))
    else:
        b=int(input("ჩაფიქრებული რიცხვი ნაკლებია თქვენს მიერ გამოცნობილ რიცხვიზე, ცადეთ ხელთავიდან:"))

"""
ამოცანა 4:
დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, 
შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს.
ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, 
რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.
"""

total_sum = 0
while True:
    a = input("შეიყვანეთ რიცხვი, თუ აღარ გსურთ გაგრძელება აკრიფეთ 'sum': ")
    if(a == 'sum'):
        print(f"საბოლოო შედეგია:{total_sum}")
        break
    elif int(a) > 0:
        total_sum+=int(a)
