'''
ამოცანა 1:
დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს, ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 
'e'-ს შეტანისას პროგრამამ უნდა დაასრულოს მუშაობა. მიღებული შედეგი დაბეჭდეთ კონსოლში.

a – append

r – remove

e – exit

გამოიყენეთ მხოლოდ ეს ბრძანებები და მოახდინეთ სიაზე ზემოქმედება.

'''

ls = []


while(True):
  move = input('''
             გთხოვთ, აირჩიეთ: a - რიცხვის დამატება, r - რიცხვის წაშლა, e - გამოსვლა:
             ''')
  if(move == 'a'):
      num = eval(input("შეიყვანეთ რიცხვი: "))
      ls.append(num)
      print("სია:", ls)

  elif(move == 'r'):
       if len(ls) > 0:
            num = int(input("შეიყვანეთ რიცხვი წასაშლელად: "))
            if num in ls:
                ls.remove(num)
                print("სია:", ls)
            else:
                print("რიცხვი სიაში არ არის!")
       else:
           print('სია ცარიელია!') 
     
  elif(move == 'e'):
        print(ls)
        break 
  
'''
ამოცანა 2:
დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას my_list_1 = [43, '22', 12, 66, 210, ["hi"]], და შეასრულებს შემდეგ ნაბიჯებს:

a. დაბეჭდავს 210-ის ინდექსს;
 
b. დაამატებს ბოლო ელემენტში ტექსტს "hello";

c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;

d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist_1-ის მნიშვნელობა, გაასუფთავეთ my_llist_2-ის მნიშნველობა და დაბეჭდეთ ორივე სია.

მინიშნება: სიის გასუფთავება – arr.clear()
'''
my_list_1 = [43, '22', 12, 66, 210, ["hi"]]
print("210-ის ინდექსი:", my_list_1.index(210))

my_list_1[-1].append('hello')
print(" ელემენტის დამატების შემდეგ:", my_list_1)

my_list_1.pop(2)
print("მეორე ინდექსის წაშლის შემდეგ:", my_list_1)

my_list_2 = my_list_1.copy()
my_list_2.clear()
print(" my_list_1:", my_list_1)
print(" my_list_2 (გასუფთავებული):", my_list_2)

'''
ამოცანა 3:
 დაწერეთ პითნის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით შეამოწმებს
 შეყვანილი ნომერი იცავს თუ არა "(123) 456-789" ფორმატს, თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, 
 წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი.

მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან.
'''
import re

number = input("შეიყვანეთ ტელეფონის ნომერი: ")

pattern = r'\(\d{3}\) \d{3}-\d{3}'

if re.fullmatch(pattern, number):
    print(number)
else:
    print("არასწორი ფორმატი")
