'''
ამოცანა 1:
დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს სტრიქონის UTF-8 დაშიფრულ ვერსიას.

'''
st = input("ჩაწერეთ წინადადება: ")
print(st.encode('utf-8'))



'''
ამოცანა 2:
დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. ჩამოაშორეთ ზედმეტი ინტერვალები. ყველა სიმბოლო გადაიყვანეთ პატარა
ასოებში და დაუმატეთ ქვესტრიქონი 'Python. თუ შეყვანილ სტრიქონში არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.

მინიშნება: ზედმეტი ინტერვალების ჩამოსაშორებელი მეთოდია .strip().

მაგ.: "  Python is funny     ".strip()   ====>  "Python is funny"

'''
st = input("შეიყვანეთ წინადადება: ")
st = st.strip().lower()
st = st + 'Python'
if 'python' in st:
      st = st.replace("python", "Python") 
print(st)


"""
ამოცანა 3:
დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. პროგრამამ უნდა დააბრუნოს ახალი სტრიქონი, რომელიც შედგება
შეყვანილი სტრიქონის პირველი ნახევრისაგან.
"""
st = input("შეიყვანეთ წინადადება: ")
n = len(st)//2
print(st[0:n])

'''
ამოცანა 4:
დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.string მოდულის გამოყენებით დაწერეთ შემოწმება.სტრიქონი ვალიდურია მაშინ, 
როდესაც ის შეიცავს მინიმუმ ერთ ლათინურ ასოსა და მინიმუმ ერთ ციფრს და ამავე დროს არ შეიცავს დამატებით
სიმბოლოებს: '!', '~', '#', '$' და ა.შ.
'''
import string

password = input("შეიყვანეთ პაროლი: ")
letters = False
digits = False
no_symbols = True

for ch in password:

    if ch in string.ascii_letters:
        letters = True

    elif ch in string.digits:
        digits = True

    elif ch == ' ':#რადგან პირობაში გამოყოვებაზე არ წერია, ვუშვებ რომ შეიძლება
      pass

    else:
        no_symbols = False

   
   
if no_symbols and digits and letters:
        print("ვალიდურია")
else:
        print("არ არის ვალიდური პაროლი")


'''

ამოცანა 5:
დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს,
სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კი
გადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს.

'''


text = input()
text_bytes = text.encode('utf-8')
print(f"ბაიტები: {text_bytes}")

decoded_text = text_bytes.decode('utf-8')

print(f"სტრიქონები: {decoded_text}")
