'''
ამოცანა 1:
შექმენით გლობალური ცვლადი int_list = [10,20,30,40] და დაწერეთ პითონის ფუნქცია, რომელიც  მიიღებს რიცხვს პარამეტრად და 
გლობალურ int_list სიაში ჩაამატებს პარამეტრად მიღებულ რიცხვს.

'''

int_list = [10, 20, 30, 40]

def add_to_list(num):
  global int_list
  int_list.append(num)

a = int(input("ჩაწერეთ მთელი რიცხვი: "))
add_to_list(a)
print(f"მიღებული სია არის {int_list}")

'''
ამოცანა 2:
დაწერეთ პითნის ფუნქცია რომელიც პარამეტრად იღებს რიცხვების სიას (ლისტს) და აბრუნებს რიცხვების ჯამს.
პარამეტრად უნდა მიიღოს შემდეგი სია [100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10].

'''

int_list =[100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10]

def list_sum(list):
  sum = 0
  for num in list:
    sum += num
  return sum

print(f"სიის წევრების ჯამია: {list_sum(int_list)}")

'''
ამოცანა 3:
შექმენით გლობალური ცვლადი gl_str = "Global" და დაწერეთ პითონის ფუნქცია რომელიც ქმნის ლოკალურ ცვლადს იგივე სახელით რაც გლობალურ 
ცვლადს აქვს  (gl_str) და აბრუნებს ლოკალური ცვლადის მნიშვნელობას.

'''
gl_str = "Global"

def local_copy():
    gl_str = "Local"
    return gl_str

print(local_copy())

'''
ამოცანა 4:
რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს ერთ პარამეტრს number და დააბრუნებს  ციფრების ჯამს
(მაგალითად თუ ფუნქციამ მიიღო რიცხვი 12345, უნდა დააბრუნოს 15. რადგან 1+2+3+4+5 უდრის 15-ს).
'''

def digit_sum(number):
    number = abs(number)
    if number < 10:
        return number
    return number % 10 + digit_sum(number//10)

a = int(input("ჩაწერეთ რიცხვი: "))
print(f"{a} რიცხვის ციფრთა ჯამის არის {digit_sum(a)}")

'''
ამოცანა 5:
რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად სტრიქონს და 
დააბრუნებს მის შებრუნებულ (revers) სტრიქონს (მაგალითად  input: Hello   Output: olleH)
'''

def reverse(st):
    if len(st) == 0:
        return ''
    return st[-1] +reverse(st[:-1])

st = input("ჩაწერეთ წინადადება: ")
print(f"შებრუნებული წინადადება იქნება: {reverse(st)}")
